; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_logistics_1)

(:domain logistics)

(:objects
	obj0 obj3 obj5 - airport
	obj1 obj6 - city
	obj2 obj4 obj7 obj10 - truck
	obj8 - airplane
	obj9 - location
	obj11 obj12 obj13 obj14 obj15 obj16 - package
)

(:init
	(in-city obj0 obj1)
	(in-city obj9 obj1)
	(at obj14 obj9)
	(at obj4 obj3)
	(at obj2 obj0)
	(at obj10 obj9)
	(at obj15 obj9)
	(at obj16 obj9)
	(at obj13 obj9)
	(in-city obj3 obj1)
	(at obj11 obj9)
	(at obj12 obj9)
	(at obj7 obj5)
	(in-city obj5 obj6)
	(at obj8 obj0)
)

(:goal (and
	(at obj16 obj5)
	(at obj13 obj5)
	(at obj12 obj5)
	(at obj14 obj5)
	(at obj15 obj5)
))
)

; plan
1. (load obj10 obj16 obj9)
   deleted: (at obj16 obj9)
   added: (in obj16 obj10)
   goals met: 0 of 5
2. (load obj10 obj15 obj9)
   deleted: (at obj15 obj9)
   added: (in obj15 obj10)
   goals met: 0 of 5
3. (load obj10 obj14 obj9)
   deleted: (at obj14 obj9)
   added: (in obj14 obj10)
   goals met: 0 of 5
4. (load obj10 obj13 obj9)
   deleted: (at obj13 obj9)
   added: (in obj13 obj10)
   goals met: 0 of 5
5. (load obj10 obj12 obj9)
   deleted: (at obj12 obj9)
   added: (in obj12 obj10)
   goals met: 0 of 5
6. (drive obj10 obj9 obj0)
   deleted: (at obj10 obj9)
   added: (at obj10 obj0)
   goals met: 0 of 5
7. (unload obj10 obj16 obj0)
   deleted: (in obj16 obj10)
   added: (at obj16 obj0)
   goals met: 0 of 5
8. (load obj8 obj16 obj0)
   deleted: (at obj16 obj0)
   added: (in obj16 obj8)
   goals met: 0 of 5
9. (unload obj10 obj15 obj0)
   deleted: (in obj15 obj10)
   added: (at obj15 obj0)
   goals met: 0 of 5
10. (load obj8 obj15 obj0)
   deleted: (at obj15 obj0)
   added: (in obj15 obj8)
   goals met: 0 of 5
11. (unload obj10 obj14 obj0)
   deleted: (in obj14 obj10)
   added: (at obj14 obj0)
   goals met: 0 of 5
12. (load obj8 obj14 obj0)
   deleted: (at obj14 obj0)
   added: (in obj14 obj8)
   goals met: 0 of 5
13. (unload obj10 obj13 obj0)
   deleted: (in obj13 obj10)
   added: (at obj13 obj0)
   goals met: 0 of 5
14. (load obj8 obj13 obj0)
   deleted: (at obj13 obj0)
   added: (in obj13 obj8)
   goals met: 0 of 5
15. (unload obj10 obj12 obj0)
   deleted: (in obj12 obj10)
   added: (at obj12 obj0)
   goals met: 0 of 5
16. (load obj8 obj12 obj0)
   deleted: (at obj12 obj0)
   added: (in obj12 obj8)
   goals met: 0 of 5
17. (fly obj8 obj0 obj5)
   deleted: (at obj8 obj0)
   added: (at obj8 obj5)
   goals met: 0 of 5
18. (unload obj8 obj16 obj5)
   deleted: (in obj16 obj8)
   added: (at obj16 obj5)
   goals met: 1 of 5
19. (unload obj8 obj15 obj5)
   deleted: (in obj15 obj8)
   added: (at obj15 obj5)
   goals met: 2 of 5
20. (unload obj8 obj14 obj5)
   deleted: (in obj14 obj8)
   added: (at obj14 obj5)
   goals met: 3 of 5
21. (unload obj8 obj13 obj5)
   deleted: (in obj13 obj8)
   added: (at obj13 obj5)
   goals met: 4 of 5
22. (unload obj8 obj12 obj5)
   deleted: (in obj12 obj8)
   added: (at obj12 obj5)
   goals met: 5 of 5
